---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.Insert(Autodesk.Revit.DB.Electrical.InsulationType)
source: html/e372817c-2086-ef15-b00a-c91ef19c2f9c.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.Insert Method

Insert the specified insulation type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	InsulationType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.InsulationType`) - The insulation type to be inserted into the set.

## Returns
Returns whether the insulation type was inserted into the set.